<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------
use think\facade\Route;

Route::get('think', function () {
    return 'hello,ThinkPHP8!';
});

Route::get('hello/:name', 'index/hello');

// 一些展示
Route::rule('info/vip_level', 'info.VipLevel/vip_level');

// ====================================================================
// 登录认证模块
// ====================================================================
Route::rule('login/login$', 'login.Login/login');         // 管理员登录页面

// ====================================================================
// 菜单管理模块
// ====================================================================
Route::rule('menu/list$', '/auth.Menu/index');    // 后台菜单列表